Ruby on Rails/espn/app/controllers/comments_controller.rb

  def create
    @message = Message.find(params[:message_id])
    @comment = @message.comments.create(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "this first comment"], ["message_id", 2], ["created_at", "2016-10-19 17:59:07.362774"], ["updated_at", "2016-10-19 17:59:07.362774"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-10-19 18:02:07.076764"], ["id", 2]]

  def find_message
    @message = Message.find(params[:message_id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 3]]

  def find_comment
    @comment = @message.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 3], ["id", 3]]