Ruby on Rails/espn/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"  ORDER BY created_at desc
---
  def index
    @messages = Message.all.order('created_at desc')

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Message with user"], ["description", "this message with user"], ["user_id", 1], ["created_at", "2016-10-18 22:09:37.982421"], ["updated_at", "2016-10-18 22:09:37.982421"]]
---
  def create
    @message = current_user.messages.build(message_params)
    if @message.save

UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "this is the first message......"], ["updated_at", "2016-10-18 19:54:52.091242"], ["id", 1]]
---
  def update
    if @message.update(message_params)